wpawel74/CMSIS/Device/ST/STM32F1xx/Include/stm32f100x8.h
/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3))

/***************** UART Instances : Multi-Processor mode **********************/
#define IS_UART_MULTIPROCESSOR_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                   ((INSTANCE) == USART2) || \
                                                   ((INSTANCE) == USART3))

/***************** UART Instances : DMA mode available **********************/
#define IS_UART_DMA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3))

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

/**************************** WWDG Instances *****************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)





/**
  * @}
*/ 
/******************************************************************************/
/*  For a painless codes migration between the STM32F1xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */ 
/*  product lines within the same STM32F1 Family                              */
/******************************************************************************/

/* Aliases for __IRQn */
#define ADC1_2_IRQn               ADC1_IRQn



#define TIM1_BRK_TIM9_IRQn        TIM1_BRK_TIM15_IRQn
#define TIM9_IRQn                 TIM1_BRK_TIM15_IRQn
#define TIM1_BRK_IRQn             TIM1_BRK_TIM15_IRQn

#define TIM1_UP_TIM10_IRQn        TIM1_UP_TIM16_IRQn
#define TIM10_IRQn                TIM1_UP_TIM16_IRQn
#define TIM1_UP_IRQn              TIM1_UP_TIM16_IRQn

#define TIM1_TRG_COM_TIM11_IRQn   TIM1_TRG_COM_TIM17_IRQn
#define TIM11_IRQn                TIM1_TRG_COM_TIM17_IRQn
#define TIM1_TRG_COM_IRQn         TIM1_TRG_COM_TIM17_IRQn



#define OTG_FS_WKUP_IRQn          CEC_IRQn
#define USBWakeUp_IRQn            CEC_IRQn



#define TIM6_IRQn                 TIM6_DAC_IRQn


/* Aliases for __IRQHandler */
#define ADC1_2_IRQHandler               ADC1_IRQHandler



#define TIM1_BRK_TIM9_IRQHandler        TIM1_BRK_TIM15_IRQHandler
#define TIM9_IRQHandler                 TIM1_BRK_TIM15_IRQHandler
#define TIM1_BRK_IRQHandler             TIM1_BRK_TIM15_IRQHandler

#define TIM1_UP_TIM10_IRQHandler        TIM1_UP_TIM16_IRQHandler
#define TIM10_IRQHandler                TIM1_UP_TIM16_IRQHandler
#define TIM1_UP_IRQHandler              TIM1_UP_TIM16_IRQHandler

#define TIM1_TRG_COM_TIM11_IRQHandler   TIM1_TRG_COM_TIM17_IRQHandler
#define TIM11_IRQHandler                TIM1_TRG_COM_TIM17_IRQHandler
#define TIM1_TRG_COM_IRQHandler         TIM1_TRG_COM_TIM17_IRQHandler



#define OTG_FS_WKUP_IRQHandler          CEC_IRQHandler
#define USBWakeUp_IRQHandler            CEC_IRQHandler



#define TIM6_IRQHandler                 TIM6_DAC_IRQHandler


/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
  }
#endif /* __cplusplus */
  
#endif /* __STM32F100x8_H */
  
  
  
  /************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
